Pandas Library
* Works on 1D and 2D Datasets

In [2]:
import pandas as pd

Pandas has two Data Structures in it
* Series        1D
* DataFrame     2D

Series in Pandas

In [ ]:
s = pd.Series([1,2,3,4,5],index=['Label for 1','Label for 2','Label for 3','Label for 4','Label for 5'])
s

Label for 1    1
Label for 2    2
Label for 3    3
Label for 4    4
Label for 5    5
dtype: int64

DataFrames

In [5]:
df = pd.DataFrame({"name" : ["Nomi","Ashu","Tim"],  "marks" : [12,10,8] } )

In [6]:
df

   name  marks
0  Nomi     12
1  Ashu     10
2   Tim      8

In [8]:
df  = pd.read_csv("weather_data.csv")

In [9]:
df

         day  temp condition
0     Monday    12     Sunny
1    Tuesday    14      Rain
2  Wednesday    15      Rain
3   Thursday    14    Cloudy
4     Friday    21     Sunny
5   Saturday    22     Sunny
6     Sunday    24     Sunny

In [ ]:
df.head()         # Gives first 5 values from the dataset

         day  temp condition
0     Monday    12     Sunny
1    Tuesday    14      Rain
2  Wednesday    15      Rain
3   Thursday    14    Cloudy
4     Friday    21     Sunny

In [11]:
df.tail()       # Gives last 5 values from the dataset

         day  temp condition
2  Wednesday    15      Rain
3   Thursday    14    Cloudy
4     Friday    21     Sunny
5   Saturday    22     Sunny
6     Sunday    24     Sunny

In [12]:
df.describe()

            temp
count   7.000000
mean   17.428571
std     4.755949
min    12.000000
25%    14.000000
50%    15.000000
75%    21.500000
max    24.000000

In [13]:
df.info()                #Info about data columns

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 3 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   day        7 non-null      object
 1   temp       7 non-null      int64
 2   condition  7 non-null      object
dtypes: int64(1), object(2)
memory usage: 300.0+ bytes

Data Selection

In [15]:
df['temp']

0    12
1    14
2    15
3    14
4    21
5    22
6    24
Name: temp, dtype: int64

In [16]:
df[['day','temp']]

         day  temp
0     Monday    12
1    Tuesday    14
2  Wednesday    15
3   Thursday    14
4     Friday    21
5   Saturday    22
6     Sunday    24

In [17]:
df.iloc[0]        # for row data

day          Monday
temp             12
condition     Sunny
Name: 0, dtype: object

In [18]:
df.dropna()         # Drops the Null values rows

         day  temp condition
0     Monday    12     Sunny
1    Tuesday    14      Rain
2  Wednesday    15      Rain
3   Thursday    14    Cloudy
4     Friday    21     Sunny
5   Saturday    22     Sunny
6     Sunday    24     Sunny

In [ ]:
df.fillna(0,inplace=True)      # (0 is the replaced data tobe in places of NA) ( inplace = True means that change the original data)

In [ ]:
df['temp'] = df['temp'].astype( " " )   # to change the type of a specfic column from float to int etcc....

In [21]:
df

         day  temp condition
0     Monday    12     Sunny
1    Tuesday    14      Rain
2  Wednesday    15      Rain
3   Thursday    14    Cloudy
4     Friday    21     Sunny
5   Saturday    22     Sunny
6     Sunday    24     Sunny

In [ ]:
df['mood']  = ['good','bad','ok','best','so so','good','average']     # Add Another column

In [23]:
df

         day  temp condition     mood
0     Monday    12     Sunny     good
1    Tuesday    14      Rain      bad
2  Wednesday    15      Rain       ok
3   Thursday    14    Cloudy     best
4     Friday    21     Sunny    so so
5   Saturday    22     Sunny     good
6     Sunday    24     Sunny  average

In [ ]:
def fx(a):     # Apply some action on some row like here lets take percentage for temp out of 30
    return 100 / 30 * a
df['percentage for temp'] = df['temp'] . apply(fx)

In [ ]:
df.drop("mood",axis=1,inplace = True)     # Drop a column     axis = 0 default for row , axis = 1 for column

In [29]:
df

         day  temp condition  percentage for temp
0     Monday    12     Sunny            40.000000
1    Tuesday    14      Rain            46.666667
2  Wednesday    15      Rain            50.000000
3   Thursday    14    Cloudy            46.666667
4     Friday    21     Sunny            70.000000
5   Saturday    22     Sunny            73.333333
6     Sunday    24     Sunny            80.000000

Merging 2 DataFrames

In [42]:
df1 = pd.DataFrame({
    "name" : ["John","Harry","Lisa"],
    "marks" : [9,5,7]
})

In [43]:
df2 = pd.DataFrame({
    "name" : ["Saad","Ali","Mishi"],
    "marks" : [8,6,9]
})

In [45]:
sdd = pd.concat([df1,df2], ignore_index= True)

In [48]:
df22 = pd.DataFrame({
    "name" : ["John","Harry","Lisa","Saad","Ali","Mishi"],
    "roll" : [123,321,432,543,121,654]
})

In [49]:
pd.merge(sdd,df22, on="name")

    name  marks  roll
0   John      9   123
1  Harry      5   321
2   Lisa      7   432
3   Saad      8   543
4    Ali      6   121
5  Mishi      9   654